In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('C:\Projects\Titanic_Project\huge_1M_titanic.csv')

##

## Data Preprocessing

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,NaN,0,0,SOTON/O2 3101272,76.760165,NaN,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,NaN,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C83,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,NaN,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,E33,C

In [4]:
data.shape

(1000000, 12)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 12 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   PassengerId  1000000 non-null  int64
 1   Survived     1000000 non-null  int64
 2   Pclass       1000000 non-null  int64
 3   Name         1000000 non-null  object
 4   Sex          1000000 non-null  object
 5   Age          801400 non-null   float64
 6   SibSp        1000000 non-null  int64
 7   Parch        1000000 non-null  int64
 8   Ticket       1000000 non-null  object
 9   Fare         1000000 non-null  float64
 10  Cabin        229805 non-null   object
 11  Embarked     997760 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 91.6+ MB

In [6]:
data.isnull().sum()

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age            198600
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin          770195
Embarked         2240
dtype: int64

In [7]:
data = data.drop(columns=['PassengerId','Name','Age','Ticket','Cabin'])

In [8]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch       Fare Embarked
0         1       1  female      0      0  76.760165        C
1         0       3    male      0      0  10.193097        S
2         0       3    male      0      0  12.029416        C
3         0       3    male      0      0  13.429448        S
4         0       3    male      0      0   4.840769        C

In [9]:
data.isnull().sum()

Survived       0
Pclass         0
Sex            0
SibSp          0
Parch          0
Fare           0
Embarked    2240
dtype: int64

In [10]:
data['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [11]:
data['Embarked'].value_counts()

Embarked
S    729468
C    186846
Q     81446
Name: count, dtype: int64

## Data Cleaning

In [12]:
data['Embarked']=data['Embarked'].replace({'S':'Southampton','C':'Chebourg','Q':'Queenstown'})

In [13]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch       Fare     Embarked
0         1       1  female      0      0  76.760165     Chebourg
1         0       3    male      0      0  10.193097  Southampton
2         0       3    male      0      0  12.029416     Chebourg
3         0       3    male      0      0  13.429448  Southampton
4         0       3    male      0      0   4.840769     Chebourg

In [14]:
data['Embarked'].value_counts()

Embarked
Southampton    729468
Chebourg       186846
Queenstown      81446
Name: count, dtype: int64

In [15]:
data.dropna(subset=['Embarked'], inplace=True)

In [16]:
data.isnull().sum()

Survived    0
Pclass      0
Sex         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [17]:
data.shape

(997760, 7)

In [18]:
data['Fare'] = data['Fare'].astype('int8')

In [19]:
data.head()

   Survived  Pclass     Sex  SibSp  Parch  Fare     Embarked
0         1       1  female      0      0    76     Chebourg
1         0       3    male      0      0    10  Southampton
2         0       3    male      0      0    12     Chebourg
3         0       3    male      0      0    13  Southampton
4         0       3    male      0      0     4     Chebourg

## Feature Encoding

In [20]:
## Encoder -- Gender ---> LabelEncoder

In [21]:
from sklearn.preprocessing import LabelEncoder

In [22]:
label = LabelEncoder()

In [23]:
data['Sex']=label.fit_transform(data['Sex'])

In [24]:
data.head()

   Survived  Pclass  Sex  SibSp  Parch  Fare     Embarked
0         1       1    0      0      0    76     Chebourg
1         0       3    1      0      0    10  Southampton
2         0       3    1      0      0    12     Chebourg
3         0       3    1      0      0    13  Southampton
4         0       3    1      0      0     4     Chebourg

In [25]:
from sklearn.preprocessing import OneHotEncoder

In [26]:
onehot = OneHotEncoder(sparse_output=False)

In [27]:
data.columns

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

In [28]:
Embarked = onehot.fit_transform(data[['Embarked']])

In [29]:
Embarked = pd.DataFrame(Embarked, columns=onehot.get_feature_names_out())

In [30]:
Embarked

        Embarked_Chebourg  Embarked_Queenstown  Embarked_Southampton
0                     1.0                  0.0                   0.0
1                     0.0                  0.0                   1.0
2                     1.0                  0.0                   0.0
3                     0.0                  0.0                   1.0
4                     1.0                  0.0                   0.0
...                   ...                  ...                   ...
997755                0.0                  0.0                   1.0
997756                0.0                  0.0                   1.0
997757                0.0                  0.0                   1.0
997758                0.0                  0.0                   1.0
997759                0.0                  0.0                   1.0

[997760 rows x 3 columns]

In [31]:
data = pd.concat([data.drop(columns=['Embarked']), Embarked],axis=True)

In [32]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,1.0,0.0,0.0,0.0,76.0,1.0,0.0,0.0
1,0.0,3.0,1.0,0.0,0.0,10.0,0.0,0.0,1.0
2,0.0,3.0,1.0,0.0,0.0,12.0,1.0,0.0,0.0
3,0.0,3.0,1.0,0.0,0.0,13.0,0.0,0.0,1.0
4,0.0,3.0,1.0,0.0,0.0,4.0,1.0,0.0,0.0

## Feature Scaling

In [33]:
from sklearn.preprocessing import StandardScaler

In [34]:
scale = StandardScaler()

In [35]:
data.columns

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Fare',
       'Embarked_Chebourg', 'Embarked_Queenstown', 'Embarked_Southampton'],
      dtype='object')

In [36]:
num_cols = ['Pclass', 'SibSp', 'Parch', 'Fare']

In [37]:
data[num_cols]=scale.fit_transform(data[num_cols])

In [38]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.0,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.0,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.0,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.0,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [39]:
import pickle

In [40]:
with open('label_encoder.pkl', 'wb')as file:
    pickle.dump(label,file)

In [41]:
with open('onehot_encoder.pkl', 'wb')as file:
    pickle.dump(onehot,file)

In [42]:
with open('scaler.pkl', 'wb')as file:
    pickle.dump(scale,file)

## Train-Validation-Test split

In [43]:
data.head()

,Survived,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,1.0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.0,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.0,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.0,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.0,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [44]:
data.isnull().sum()

Survived                2234
Pclass                  2234
Sex                     2234
SibSp                   2234
Parch                   2234
Fare                    2234
Embarked_Chebourg       2234
Embarked_Queenstown     2234
Embarked_Southampton    2234
dtype: int64

In [45]:
data= data.dropna()

In [46]:
X=data.drop(columns='Survived')

In [47]:
y=data['Survived']

In [48]:
X.head()

,Pclass,Sex,SibSp,Parch,Fare,Embarked_Chebourg,Embarked_Queenstown,Embarked_Southampton
0,-1.568865,0.0,-0.462644,-0.469267,1.675922,1.0,0.0,0.0
1,0.824107,1.0,-0.462644,-0.469267,-0.234102,0.0,0.0,1.0
2,0.824107,1.0,-0.462644,-0.469267,-0.176222,1.0,0.0,0.0
3,0.824107,1.0,-0.462644,-0.469267,-0.147283,0.0,0.0,1.0
4,0.824107,1.0,-0.462644,-0.469267,-0.407741,1.0,0.0,0.0

In [49]:
X.isnull().sum()

Pclass                  0
Sex                     0
SibSp                   0
Parch                   0
Fare                    0
Embarked_Chebourg       0
Embarked_Queenstown     0
Embarked_Southampton    0
dtype: int64

In [50]:
y.head()

0    1.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: Survived, dtype: float64

In [51]:
y.isnull().sum()

np.int64(0)

In [52]:
from sklearn.model_selection import train_test_split

In [53]:
X_train, X_test, y_train, y_test=train_test_split(X,y,test_size=20, random_state = 42)

In [54]:
X_train, X_valid, y_train, y_valid=train_test_split(X_train, y_train, test_size=0.2, random_state=42)

In [55]:
X_train.shape

(796404, 8)

In [56]:
X_valid.shape

(199102, 8)

In [57]:
import tensorflow

 ## Model Building

In [58]:
(X_train.shape[1],)

(8,)

In [59]:
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
from tensorflow.keras.callbacks import EarlyStopping

In [60]:
model = Sequential([Dense(128, input_shape=(X_train.shape[1],), activation='relu'),# First hidden Layer
Dense(64, activation='relu'),
Dense(32, activation='relu'),
Dense(1,activation='sigmoid')])

c:\Projects\Titanic_Project\venv\Lib\site-packages\keras\src\layers\core\dense.py:106: UserWarning: Do not pass an `input_shape`/`input_dim` argument to a layer. When using Sequential models, prefer using an `Input(shape)` object as the first layer in the model instead.
  super().__init__(activity_regularizer=activity_regularizer, **kwargs)

In [61]:
model.summary()

Model: "sequential"

â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”³â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”³â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”“
â”ƒ Layer (type)                    â”ƒ Output Shape           â”ƒ       Param # â”ƒ
â”¡â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â•‡â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â•‡â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”©
â”‚ dense (Dense)                   â”‚ (None, 128)            â”‚         1,152 â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚ dense_1 (Dense)                 â”‚ (None, 64)             â”‚         8,256 â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚ dense_2 (Dense)                 â”‚ (None, 32)             â”‚         2,080 â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚ dense_3 (Dense)                 â”‚ (None, 1)              â”‚            33 â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜

 Total params: 11,521 (45.00 KB)

 Trainable params: 11,521 (45.00 KB)

 Non-trainable params: 0 (0.00 B)

## Model Compilaion ---> Optimizer, Loss, Metrics

In [62]:
opt = tensorflow.keras.optimizers.Adam(learning_rate=0.01)

In [63]:
model.compile(optimizer=opt, loss='binary_crossentropy', metrics=['accuracy'])

In [64]:
stopping_callback = EarlyStopping(monitor='val_loss', patience=5,restore_best_weights=True)

In [65]:
# X_train, X_valid, y_train, y_valid

In [66]:
model.fit(X_train,y_train,validation_data=(X_valid, y_valid), epochs=10, callbacks=[stopping_callback])

Epoch 1/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 70s 3ms/step - accuracy: 0.8447 - loss: 0.3494 - val_accuracy: 0.8510 - val_loss: 0.3342
Epoch 2/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 71s 3ms/step - accuracy: 0.8498 - loss: 0.3376 - val_accuracy: 0.8521 - val_loss: 0.3348
Epoch 3/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 67s 3ms/step - accuracy: 0.8498 - loss: 0.3372 - val_accuracy: 0.8519 - val_loss: 0.3315
Epoch 4/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 66s 3ms/step - accuracy: 0.8506 - loss: 0.3364 - val_accuracy: 0.8513 - val_loss: 0.3325
Epoch 5/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 67s 3ms/step - accuracy: 0.8500 - loss: 0.3370 - val_accuracy: 0.8511 - val_loss: 0.3354
Epoch 6/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 69s 3ms/step - accuracy: 0.8492 - loss: 0.3370 - val_accuracy: 0.8508 - val_loss: 0.3312
Epoch 7/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 39s 2ms/step - accuracy: 0.8487 - loss: 0.3361 - val_accuracy: 0.8502 - val_loss: 0.3356
Epoch 8/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 31s 1ms/step - accuracy: 0.8488 - loss: 0.3364 - val_accuracy: 0.8513 - val_loss: 0.3321
Epoch 9/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 31s 1ms/step - accuracy: 0.8492 - loss: 0.3367 - val_accuracy: 0.8520 - val_loss: 0.3321
Epoch 10/10
24888/24888 â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â” 31s 1ms/step - accuracy: 0.8490 - loss: 0.3369 - val_accuracy: 0.8531 - val_loss: 0.3315

In [67]:
model.save('model.h5')

WARNING:absl:You are saving your model as an HDF5 file via `model.save()` or `keras.saving.save_model(model)`. This file format is considered legacy. We recommend using instead the native Keras format, e.g. `model.save('my_model.keras')` or `keras.saving.save_model(model, 'my_model.keras')`.